apache/nuttx/arch/arm/src/stm32c0/hardware/stm32c0_rcc.h
/****************************************************************************
 * arch/arm/src/stm32c0/hardware/stm32c0_rcc.h
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_STM32C0_HARDWARE_STM32C0_RCC_H
#define __ARCH_ARM_SRC_STM32C0_HARDWARE_STM32C0_RCC_H

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* NOTE: STM32C0 does not have separate APB1 and APB2 buses, but uses single
 * APB bus, however, divided into two sets of registers. For compatibility
 * with other families, we leave the register names as APB1xx and APB2yy.
 */

/* Register Offsets *********************************************************/

#define STM32_RCC_CR_OFFSET         0x0000  /* Clock control register */
#define STM32_RCC_ICSCR_OFFSET      0x0004  /* Internal clock sources calibration register */
#define STM32_RCC_CFGR_OFFSET       0x0008  /* Clock configuration register */
#define STM32_RCC_CRRCR_OFFSET      0x0014  /* Clock recovery RC register */
#define STM32_RCC_CIER_OFFSET       0x0018  /* Clock Source Interrupt enable register */
#define STM32_RCC_CIFR_OFFSET       0x001c  /* Clock Source Interrupt Flag register */
#define STM32_RCC_CICR_OFFSET       0x0020  /* Clock Source Interrupt Clear register */
#define STM32_RCC_IOPRSTR_OFFSET    0x0024  /* GPIO reset register */
#define STM32_RCC_AHBRSTR_OFFSET    0x0028  /* AHB peripheral reset register */
#define STM32_RCC_APB1RSTR_OFFSET   0x002c  /* APB Peripheral reset register 1 */
#define STM32_RCC_APB2RSTR_OFFSET   0x0030  /* APB Peripheral reset register 2 */
#define STM32_RCC_IOPENR_OFFSET     0x0034  /* GPIO clock enable register */
#define STM32_RCC_AHBENR_OFFSET     0x0038  /* AHB Peripheral Clock enable register */
#define STM32_RCC_APB1ENR_OFFSET    0x003c  /* APB Peripheral Clock enable register 1 */
#define STM32_RCC_APB2ENR_OFFSET    0x0040  /* APB Peripheral Clock enable register 2 */
#define STM32_RCC_IOPSMEN_OFFSET    0x0044  /* GPIO clock enable in Sleep mode register */
#define STM32_RCC_AHBSMENR_OFFSET   0x0048  /* AHB peripheral clock enable in Sleep mode register */
#define STM32_RCC_APBSMENR1_OFFSET  0x004c  /* APB peripheral clock enable in Sleep mode register 1 */
#define STM32_RCC_APBSMENR2_OFFSET  0x0050  /* APB peripheral clock enable in Sleep mode register 2 */
#define STM32_RCC_CCIPR1_OFFSET     0x0054  /* Clock configuration register 1 */
#define STM32_RCC_CCIPR2_OFFSET     0x0058  /* Clock configuration register 2 */
#define STM32_RCC_CSR1_OFFSET       0x005c  /* Control/status register 1 */
#define STM32_RCC_CSR2_OFFSET       0x0060  /* Control/status register 2*/

/* Register Addresses *******************************************************/

#define STM32_RCC_CR                (STM32_RCC_BASE+STM32_RCC_CR_OFFSET)
#define STM32_RCC_ICSCR             (STM32_RCC_BASE+STM32_RCC_ICSCR_OFFSET)
#define STM32_RCC_CFGR              (STM32_RCC_BASE+STM32_RCC_CFGR_OFFSET)
#define STM32_RCC_CRRCR             (STM32_RCC_BASE+STM32_RCC_CRRCR_OFFSET)
#define STM32_RCC_CIER              (STM32_RCC_BASE+STM32_RCC_CIER_OFFSET)
#define STM32_RCC_CIFR              (STM32_RCC_BASE+STM32_RCC_CIFR_OFFSET)
#define STM32_RCC_CICR              (STM32_RCC_BASE+STM32_RCC_CICR_OFFSET)
#define STM32_RCC_IOPRSTR           (STM32_RCC_BASE+STM32_RCC_IOPRSTR_OFFSET)
#define STM32_RCC_AHBRSTR           (STM32_RCC_BASE+STM32_RCC_AHBRSTR_OFFSET)
#define STM32_RCC_APB1RSTR          (STM32_RCC_BASE+STM32_RCC_APB1RSTR_OFFSET)
#define STM32_RCC_APB2RSTR          (STM32_RCC_BASE+STM32_RCC_APB2RSTR_OFFSET)
#define STM32_RCC_IOPENR            (STM32_RCC_BASE+STM32_RCC_IOPENR_OFFSET)
#define STM32_RCC_AHBENR            (STM32_RCC_BASE+STM32_RCC_AHBENR_OFFSET)
#define STM32_RCC_APB1ENR           (STM32_RCC_BASE+STM32_RCC_APB1ENR_OFFSET)
#define STM32_RCC_APB2ENR           (STM32_RCC_BASE+STM32_RCC_APB2ENR_OFFSET)
#define STM32_RCC_IOPSMEN           (STM32_RCC_BASE+STM32_RCC_IOPSMEN_OFFSET)
#define STM32_RCC_AHBSMENR          (STM32_RCC_BASE+STM32_RCC_AHBSMENR_OFFSET)
#define STM32_RCC_APBSMENR1         (STM32_RCC_BASE+STM32_RCC_APBSMENR1_OFFSET)
#define STM32_RCC_APBSMENR2         (STM32_RCC_BASE+STM32_RCC_APBSMENR2_OFFSET)
#define STM32_RCC_CCIPR1            (STM32_RCC_BASE+STM32_RCC_CCIPR1_OFFSET)
#define STM32_RCC_CCIPR2            (STM32_RCC_BASE+STM32_RCC_CCIPR2_OFFSET)
#define STM32_RCC_CSR1              (STM32_RCC_BASE+STM32_RCC_CSR1_OFFSET)
#define STM32_RCC_CSR2              (STM32_RCC_BASE+STM32_RCC_CSR2_OFFSET)

/* Register Bitfield Definitions ********************************************/

/* Clock control register */

                                              /* Bits 0-1: Reserved */

#define RCC_CR_SYSDIV_SHIFT         (2)       /* Bit 2-4: Clock division factor for system clock */
#define RCC_CR_HSIKERDIV_SHIFT      (5)       /* Bit 5-7: HSI48 kernel clock division factor */
#define RCC_CR_HSION                (1 << 8)  /* Bit 8: Internal high speed clock enable */
#define RCC_CR_HSIKERON             (1 << 9)  /* Bit 9: Internal high speed clock enable for some IP kernels */
#define RCC_CR_HSIRDY               (1 << 10) /* Bit 10: Internal high speed clock ready flag */
#define RCC_CR_HSIDIV_SHIFT         (11)      /* Bit 11: Internal high speed clock divider */
#define RCC_CR_HSIDIV_MASK          (7 << RCC_CR_HSIDIV_SHIFT)
#define RCC_CR_HSIDIV_HSI           (0 << RCC_CR_HSIDIV_SHIFT)
#define RCC_CR_HSIDIV_HSId2         (1 << RCC_CR_HSIDIV_SHIFT)
#define RCC_CR_HSIDIV_HSId4         (2 << RCC_CR_HSIDIV_SHIFT)
#define RCC_CR_HSIDIV_HSId8         (3 << RCC_CR_HSIDIV_SHIFT)
#define RCC_CR_HSIDIV_HSId16        (4 << RCC_CR_HSIDIV_SHIFT)
#define RCC_CR_HSIDIV_HSId32        (5 << RCC_CR_HSIDIV_SHIFT)
#define RCC_CR_HSIDIV_HSId64        (6 << RCC_CR_HSIDIV_SHIFT)
#define RCC_CR_HSIDIV_HSId128       (7 << RCC_CR_HSIDIV_SHIFT)
                                              /* Bits 14-15: Reserved */
#define RCC_CR_HSEON                (1 << 16) /* Bit 16: External high speed clock enable */
#define RCC_CR_HSERDY               (1 << 17) /* Bit 17: External high speed clock ready flag */
#define RCC_CR_HSEBYP               (1 << 18) /* Bit 18: External high speed clock bypass */

#define RCC_CR_CSSON                (1 << 19) /* Bit 19: Clock security system enable */
                                              /* Bits 20-21: Reserved */
#define RCC_CR_HSIUSB48ON           (1 << 22) /* Bit 22: HSIUSB48 clock enable */
#define RCC_CR_HSIUSB48RDY          (1 << 23) /* Bit 23: HSIUSB48 clock ready flag */
                                              /* Bits 24-31: Reserved */

