apache/nuttx/arch/arm/src/stm32c0/hardware/stm32c0_rcc.h
#define RCC_CR_RESET                0x00001540

/* Internal clock sources calibration register */

#define RCC_ICSCR_HSICAL_SHIFT      (0)                             /* Bits 0-7:  Internal high speed clock calibration */
#define RCC_ICSCR_HSICAL_MASK       (0xff << RCC_ICSCR_HSICAL_SHIFT)
#define RCC_ICSCR_HSITRIM_SHIFT     (8)                             /* Bits 8-12:  High speed internal clock trimming */
#define RCC_ICSCR_HSITRIM_MASK      (0x1f << RCC_ICSCR_HSITRIM_SHIFT)
#define RCC_ICSCR_MSIRANGE_SHIFT    (13)                            /* Bits 13-15:  MSI clock ranges */
#define RCC_ICSCR_MSIRANGE_MASK     (7 << RCC_ICSCR_MSIRANGE_SHIFT)
#  define RCC_ICSCR_MSIRANGE_0      (0 << RCC_ICSCR_MSIRANGE_SHIFT) /* 000: Range 0 around 65.536 kHz */
#  define RCC_ICSCR_MSIRANGE_1      (1 << RCC_ICSCR_MSIRANGE_SHIFT) /* 001: Range 1 around 131.072 kHz */
#  define RCC_ICSCR_MSIRANGE_2      (2 << RCC_ICSCR_MSIRANGE_SHIFT) /* 010: Range 2 around 262.144 kHz */
#  define RCC_ICSCR_MSIRANGE_3      (3 << RCC_ICSCR_MSIRANGE_SHIFT) /* 011: Range 3 around 524.288 kHz */
#  define RCC_ICSCR_MSIRANGE_4      (4 << RCC_ICSCR_MSIRANGE_SHIFT) /* 100: Range 4 around 1.048 MHz */
#  define RCC_ICSCR_MSIRANGE_5      (5 << RCC_ICSCR_MSIRANGE_SHIFT) /* 101: Range 5 around 2.097 MHz (reset value) */
#  define RCC_ICSCR_MSIRANGE_6      (6 << RCC_ICSCR_MSIRANGE_SHIFT) /* 110: Range 6 around 4.194 MHz */
#define RCC_ICSCR_MSICAL_SHIFT      (16)                            /* Bits 16-23:  MSI clock calibration */
#define RCC_ICSCR_MSICAL_MASK       (0xff << RCC_ICSCR_MSICAL_SHIFT)
#define RCC_ICSCR_MSITRIM_SHIFT     (24)                            /* Bits 24-31:  MSI clock trimming */
#define RCC_ICSCR_MSITRIM_MASK      (0xff << RCC_ICSCR_MSITRIM_SHIFT)

#define RCC_ICSR_RSTVAL             0x0000b000

/* Clock recovery RC register */

#define RCC_CRRCR_HSIUSB48CAL_SHIFT (0)       /* Bits 0-8: HSIUSB48 clock calibration */
#define RCC_CRRCR_HSIUSB48CAL_MASK  (0x1ff << RCC_CRRCR_HSIUSB48CAL_SHIFT)
                                              /* Bits 9-31: Reserved */

/* Clock configuration register */

#define RCC_CFGR_SW_SHIFT           (0)                         /* Bits 0-2: System clock Switch */
#define RCC_CFGR_SW_MASK            (7 << RCC_CFGR_SW_SHIFT)
#  define RCC_CFGR_SW_HSI           (0 << RCC_CFGR_SW_SHIFT)    /* 000: HSI selected as system clock */
#  define RCC_CFGR_SW_HSE           (1 << RCC_CFGR_SW_SHIFT)    /* 001: HSE selected as system clock */
#  define RCC_CFGR_SW_HSIUSB48      (2 << RCC_CFGR_SW_SHIFT)    /* 010: HSIUSB48 selected as system clock */
#  define RCC_CFGR_SW_LSI           (3 << RCC_CFGR_SW_SHIFT)    /* 011: LSI selected as system clock */
#  define RCC_CFGR_SW_LSE           (4 << RCC_CFGR_SW_SHIFT)    /* 100: LSE selected as system clock */
#define RCC_CFGR_SWS_SHIFT          (3)                         /* Bits 2-3: System Clock Switch Status */
#define RCC_CFGR_SWS_MASK           (7 << RCC_CFGR_SWS_SHIFT)
#  define RCC_CFGR_SWS_HSI          (0 << RCC_CFGR_SWS_SHIFT)   /* 000: HSI used as system clock */
#  define RCC_CFGR_SWS_HSE          (1 << RCC_CFGR_SWS_SHIFT)   /* 001: HSE used as system clock */
#  define RCC_CFGR_SWS_HSIUSB48     (2 << RCC_CFGR_SWS_SHIFT)   /* 010: HSIUSB48 used as system clock */
#  define RCC_CFGR_SWS_LSI          (3 << RCC_CFGR_SWS_SHIFT)   /* 011: LSI used as system clock */
#  define RCC_CFGR_SWS_LSE          (4 << RCC_CFGR_SWS_SHIFT)   /* 100: LSE used as system clock */
                                                                /* Bits 6-7: Reserved */
#define RCC_CFGR_HPRE_SHIFT         (8)                         /* Bits 8-11: AHB prescaler */
#define RCC_CFGR_HPRE_MASK          (0x0f << RCC_CFGR_HPRE_SHIFT)
#  define RCC_CFGR_HPRE_SYSCLK      (0 << RCC_CFGR_HPRE_SHIFT)  /* 0xxx: SYSCLK not divided */
#  define RCC_CFGR_HPRE_SYSCLKd2    (8 << RCC_CFGR_HPRE_SHIFT)  /* 1000: SYSCLK divided by 2 */
#  define RCC_CFGR_HPRE_SYSCLKd4    (9 << RCC_CFGR_HPRE_SHIFT)  /* 1001: SYSCLK divided by 4 */
#  define RCC_CFGR_HPRE_SYSCLKd8    (10 << RCC_CFGR_HPRE_SHIFT) /* 1010: SYSCLK divided by 8 */
#  define RCC_CFGR_HPRE_SYSCLKd16   (11 << RCC_CFGR_HPRE_SHIFT) /* 1011: SYSCLK divided by 16 */
#  define RCC_CFGR_HPRE_SYSCLKd64   (12 << RCC_CFGR_HPRE_SHIFT) /* 1100: SYSCLK divided by 64 */
#  define RCC_CFGR_HPRE_SYSCLKd128  (13 << RCC_CFGR_HPRE_SHIFT) /* 1101: SYSCLK divided by 128 */
#  define RCC_CFGR_HPRE_SYSCLKd256  (14 << RCC_CFGR_HPRE_SHIFT) /* 1110: SYSCLK divided by 256 */
#  define RCC_CFGR_HPRE_SYSCLKd512  (15 << RCC_CFGR_HPRE_SHIFT) /* 1111: SYSCLK divided by 512 */

#define RCC_CFGR_PPRE_SHIFT         (12)                        /* Bits 12-14: APB Low speed prescaler (APB) */
#define RCC_CFGR_PPRE_MASK          (7 << RCC_CFGR_PPRE_SHIFT)
#  define RCC_CFGR_PPRE_HCLK        (0 << RCC_CFGR_PPRE_SHIFT)  /* 0xx: HCLK not divided */
#  define RCC_CFGR_PPRE_HCLKd2      (4 << RCC_CFGR_PPRE_SHIFT)  /* 100: HCLK divided by 2 */
#  define RCC_CFGR_PPRE_HCLKd4      (5 << RCC_CFGR_PPRE_SHIFT)  /* 101: HCLK divided by 4 */
#  define RCC_CFGR_PPRE_HCLKd8      (6 << RCC_CFGR_PPRE_SHIFT)  /* 110: HCLK divided by 8 */
#  define RCC_CFGR_PPRE_HCLKd16     (7 << RCC_CFGR_PPRE_SHIFT)  /* 111: HCLK divided by 16 */
                                                                /* Bit 15: Reserved */
                                                                /* TODO: MCO bits */
#define RCC_CFGR_RESET              0x00000000

/* Clock Source Interrupt enable register */

#define RCC_CIER_LSIRDYF            (1 << 0)  /* Bit 0: LSI ready interrupt flag */
#define RCC_CIER_LSERDYF            (1 << 1)  /* Bit 1: LSE ready interrupt flag */
#define RCC_CIER_HSIUSB48RDYE       (1 << 2)  /* Bit 2: HSI48USB ready interrupt flag */
#define RCC_CIER_HSIRDYF            (1 << 3)  /* Bit 3: HSI ready interrupt flag */
#define RCC_CIER_HSERDYF            (1 << 5)  /* Bit 5: MSE ready interrupt flag */

/* Clock Source Interrupt Flag register */

#define RCC_CIFR_LSIRDYF            (1 << 0)  /* Bit 0: LSI ready interrupt flag */
#define RCC_CIFR_LSERDYF            (1 << 1)  /* Bit 1: LSE ready interrupt flag */
#define RCC_CIFR_HSIUSB48RDYE       (1 << 2)  /* Bit 2: HSI16 ready interrupt flag */
#define RCC_CIFR_HSIRDYF            (1 << 3)  /* Bit 3: HSI ready interrupt flag */
#define RCC_CIFR_HSERDYF            (1 << 5)  /* Bit 5: MSE ready interrupt flag */

/* Clock Source Interrupt Clear register */

