apache/nuttx/arch/arm/src/stm32c0/hardware/stm32c0_rcc.h
#define RCC_CICR_LSIRDYF            (1 << 0)  /* Bit 0: LSI ready interrupt flag */
#define RCC_CICR_LSERDYF            (1 << 1)  /* Bit 1: LSE ready interrupt flag */
#define RCC_CICR_HSIUSB48RDYE       (1 << 2)  /* Bit 2: HSI16 ready interrupt flag */
#define RCC_CICR_HSIRDYF            (1 << 3)  /* Bit 3: HSI ready interrupt flag */
#define RCC_CICR_HSERDYF            (1 << 5)  /* Bit 5: MSE ready interrupt flag */

/* GPIO reset register */

#define RCC_IOPRSTR_IOPARST         (1 << 0)  /* Bit 0: IO port A reset */
#define RCC_IOPRSTR_IOPBRST         (1 << 1)  /* Bit 1: IO port B reset */
#define RCC_IOPRSTR_IOPCRST         (1 << 2)  /* Bit 2: IO port C reset */
#define RCC_IOPRSTR_IOPDRST         (1 << 3)  /* Bit 3: IO port D reset */
#define RCC_IOPRSTR_IOPFRST         (1 << 5)  /* Bit 5: IO port F reset */

/* AHB peripheral reset register */

#define RCC_AHBRSTR_DMA1RST         (1 << 0)  /* Bit 0: DMA 1 reset */
                                              /* Bits 1-7: Reserved */
#define RCC_AHBRSTR_MIFRST          (1 << 8)  /* Bit 8: Memory interface reset */
                                              /* Bits 9-11: Reserved */
#define RCC_AHBRSTR_CRCRST          (1 << 12) /* Bit 12: Memory interface reset */
                                              /* Bits 13-31: Reserved */

/* APB Peripheral reset register 1 */

#define RCC_APB1RSTR_TIM2RST        (1 << 0)  /* Bit 0:  Timer 2 reset */
#define RCC_APB1RSTR_TIM3RST        (1 << 1)  /* Bit 1:  Timer 3 reset */
                                              /* Bits 2-11: Reserved */
#define RCC_APB1RSTR_FDCANRST       (1 << 12) /* Bit 12: FDCAN reset */
#define RCC_APB1RSTR_USBRST         (1 << 13) /* Bit 13: USB reset */
#define RCC_APB1RSTR_SPI2RST        (1 << 14) /* Bit 14: SPI 2 reset */
                                              /* Bit 15: Reserved */
#define RCC_APB1RSTR_CRSRST         (1 << 16) /* Bit 16: CRS reset */
#define RCC_APB1RSTR_USART2RST      (1 << 17) /* Bit 17: USART 2 reset */
#define RCC_APB1RSTR_USART3RST      (1 << 18) /* Bit 18: USART 3 reset */
#define RCC_APB1RSTR_USART4RST      (1 << 19) /* Bit 19: USART 4 reset */
                                              /* Bit 20: Reserved */
#define RCC_APB1RSTR_I2C1RST        (1 << 21) /* Bit 21: I2C 1 reset */
                                              /* Bits 22-26: Reserved */
#define RCC_APB1RSTR_DBGRST         (1 << 27) /* Bit 27: Debug interface reset */
#define RCC_APB1RSTR_PWRRST         (1 << 28) /* Bit 28: Power interface reset */
                                              /* Bits 29-31: Reserved */

/* APB Peripheral reset register 2 */

#define RCC_APB2RSTR_SYSCFGRST      (1 << 0)  /* Bit 0: SYSCFG reset */
                                              /* Bits 1-10: Reserved */
#define RCC_APB2RSTR_TIM1RST        (1 << 11) /* Bit 11: TIM1 reset */
#define RCC_APB2RSTR_SPI1RST        (1 << 12) /* Bit 12: SPI1 reset */
                                              /* Bit 13: Reserved */
#define RCC_APB2RSTR_USART1RST      (1 << 14) /* Bit 14: USART1 reset */
#define RCC_APB2RSTR_TIM14RST       (1 << 15) /* Bit 15: TIM14 reset */
#define RCC_APB2RSTR_TIM15RST       (1 << 16) /* Bit 16: TIM15 reset */
#define RCC_APB2RSTR_TIM16RST       (1 << 17) /* Bit 17: TIM16 reset */
#define RCC_APB2RSTR_TIM17RST       (1 << 18) /* Bit 18: TIM17 reset */
                                              /* Bit 19: Reserved */
#define RCC_APB2RSTR_ADC1RST        (1 << 20) /* Bit 20: ADC reset */
                                              /* Bits 21-31: Reserved */

/* GPIO clock enable register */

#define RCC_IOPENR_IOPAEN           (1 << 0)  /* Bit 0: IO port A clock enable */
#define RCC_IOPENR_IOPBEN           (1 << 1)  /* Bit 1: IO port B clock enable */
#define RCC_IOPENR_IOPCEN           (1 << 2)  /* Bit 2: IO port C clock enable */
#define RCC_IOPENR_IOPDEN           (1 << 3)  /* Bit 3: IO port D clock enable */
#define RCC_IOPENR_IOPFEN           (1 << 5)  /* Bit 5: IO port F clock enable */

/* AHB Peripheral Clock enable register */

#define RCC_AHBENR_DMA1EN           (1 << 0)  /* Bit 0: DMA 1 clock enable */
                                              /* Bits 1-7: Reserved */
#define RCC_AHBENR_MIFEN            (1 << 8)  /* Bit 8: Memory interface clock enable */
                                              /* Bits 9-11: Reserved */
#define RCC_AHBENR_CRCEN            (1 << 12) /* Bit 12: Memory interface clock enable */
                                              /* Bits 13-31: Reserved */

/* APB Peripheral Clock enable register 1 */

#define RCC_APB1ENR_TIM2EN           (1 << 0)  /* Bit 0:  Timer 2 clock enable */
#define RCC_APB1ENR_TIM3EN           (1 << 1)  /* Bit 1:  Timer 3 clock enable */
                                               /* Bits 2-11: Reserved */
#define RCC_APB1ENR_FDCANEN          (1 << 12) /* Bit 12: FDCAN clock enable */
#define RCC_APB1ENR_USBEN            (1 << 13) /* Bit 13: USB clock enable */
#define RCC_APB1ENR_SPI2EN           (1 << 14) /* Bit 14: SPI 2 clock enable */
                                               /* Bit 15: Reserved */
#define RCC_APB1ENR_CRSEN            (1 << 16) /* Bit 16: CRS clock enable */
#define RCC_APB1ENR_USART2EN         (1 << 17) /* Bit 17: USART 2 clock enable */
#define RCC_APB1ENR_USART3EN         (1 << 18) /* Bit 18: USART 3 clock enable */
#define RCC_APB1ENR_USART4EN         (1 << 19) /* Bit 19: USART 4 clock enable */
                                               /* Bit 20: Reserved */
#define RCC_APB1ENR_I2C1EN           (1 << 21) /* Bit 21: I2C 1 clock enable */
                                               /* Bits 22-26: Reserved */
#define RCC_APB1ENR_DBGEN            (1 << 27) /* Bit 27: Debug interface clock enable */
#define RCC_APB1ENR_PWREN            (1 << 28) /* Bit 28: Power interface clock enable */
                                               /* Bits 29-31: Reserved */

/* APB Peripheral Clock enable register 2 */

#define RCC_APB2ENR_SYSCFGEN        (1 << 0)  /* Bit 0: SYSCFG clock enable */
                                              /* Bits 1-10: Reserved */
#define RCC_APB2ENR_TIM1EN          (1 << 11) /* Bit 11: TIM1 clock enable */
#define RCC_APB2ENR_SPI1EN          (1 << 12) /* Bit 12: SPI1 clock enable */
                                              /* Bit 13: Reserved */
#define RCC_APB2ENR_USART1EN        (1 << 14) /* Bit 14: USART1 clock enable */
#define RCC_APB2ENR_TIM14EN         (1 << 15) /* Bit 15: TIM14 clock enable */
#define RCC_APB2ENR_TIM15EN         (1 << 16) /* Bit 16: TIM15 clock enable */
#define RCC_APB2ENR_TIM16EN         (1 << 17) /* Bit 17: TIM16 clock enable */
#define RCC_APB2ENR_TIM17EN         (1 << 18) /* Bit 18: TIM17 clock enable */
                                              /* Bit 19: Reserved */
#define RCC_APB2ENR_ADC1EN          (1 << 20) /* Bit 20: ADC clock enable */
                                              /* Bits 21-31: Reserved */

/* TODO: GPIO clock enable in Sleep mode register */

/* TODO: AHB peripheral clock enable in Sleep mode register */

