apache/nuttx/arch/arm/src/stm32c0/hardware/stm32c0_rcc.h
/* TODO: APB1 peripheral clock enable in Sleep mode register */

/* RCC peripherals independent clock configuration register 1 */

#define RCC_CCIPR1_USART1SEL_SHIFT    (0) /* Bits 0-1: USART1 clock source selection */
#  define RCC_CCIPR1_USART1SEL_PCLK   (0 << RCC_CCIPR1_USART1SEL_SHIFT)
#  define RCC_CCIPR1_USART1SEL_SYSCLK (1 << RCC_CCIPR1_USART1SEL_SHIFT)
#  define RCC_CCIPR1_USART1SEL_HSIKER (2 << RCC_CCIPR1_USART1SEL_SHIFT)
#  define RCC_CCIPR1_USART1SEL_LSE    (3 << RCC_CCIPR1_USART1SEL_SHIFT)
#define RCC_CCIPR1_FDCAN1SEL_SHIFT    (8) /* Bits 8-9: FDCAN1 clock source selection */
#  define RCC_CCIPR1_FDCAN1SEL_PCLK   (0 << RCC_CCIPR1_FDCAN1SEL_SHIFT)
#  define RCC_CCIPR1_FDCAN1SEL_SYSCLK (1 << RCC_CCIPR1_FDCAN1SEL_SHIFT)
#  define RCC_CCIPR1_FDCAN1SEL_HSIKER (2 << RCC_CCIPR1_FDCAN1SEL_SHIFT)
#define RCC_CCIPR1_I2C1SEL_SHIFT      (12) /* Bits 12-13: I2C1 clock source selection */
#  define RCC_CCIPR1_I2C1SEL_PCLK     (0 << RCC_CCIPR1_I2C1SEL_SHIFT)
#  define RCC_CCIPR1_I2C1SEL_SYSCLK   (1 << RCC_CCIPR1_I2C1SEL_SHIFT)
#  define RCC_CCIPR1_I2C1SEL_HSIKER   (2 << RCC_CCIPR1_I2C1SEL_SHIFT)
#define RCC_CCIPR1_I2S1SEL_SHIFT      (14) /* Bits 14-15: I2S1 clock source selection */
#  define RCC_CCIPR1_I2S1SEL_PCLK     (0 << RCC_CCIPR1_I2S1SEL_SHIFT)
#  define RCC_CCIPR1_I2S1SEL_HSIKER   (2 << RCC_CCIPR1_I2S1SEL_SHIFT)
#  define RCC_CCIPR1_I2S1SEL_I2S      (3 << RCC_CCIPR1_I2S1SEL_SHIFT)
#define RCC_CCIPR1_ADC1SEL_SHIFT      (30) /* Bits 30-31: ADC1 clock source selection */
#  define RCC_CCIPR1_ADC1SEL_SYSCLK   (0 << RCC_CCIPR1_ADC1SEL_SHIFT)
#  define RCC_CCIPR1_ADC1SEL_HSIKER   (2 << RCC_CCIPR1_ADC1SEL_SHIFT)

/* RCC peripherals independent clock configuration register 2 */

#define RCC_CCIPR2_USBSEL_SHIFT       (12) /* Bit 12: SB clock source selection */
#define RCC_CCIPR2_USBSEL_HSIUSB48    (0 << RCC_CCIPR2_USBSEL_SHIFT)
#define RCC_CCIPR2_USBSEL_HSE         (1 << RCC_CCIPR2_USBSEL_SHIFT)

/* Clock configuration register 1 */

#define RCC_CSR1_LSEON              (1 << 0)  /* Bit 0: LSE enable */
#define RCC_CSR1_LSERDY             (1 << 1)  /* Bit 1: LSE ready */
#define RCC_CSR1_LSEBPY             (1 << 2)  /* Bit 2: LSE bypass */
#define RCC_CSR1_LSEDRV_SHIFT       (1 << 3)  /* Bit 3: LSE driving capability */
                                              /* Bit 4: Reserved */
#define RCC_CSR1_CSSLSEON           (1 << 5)  /* Bit 5: CSS on LSE enable */
#define RCC_CSR1_CSSLSED            (1 << 6)  /* Bit 6: CSS on LSE failure detection flag */
                                              /* Bit 7: Reserved */
#define RCC_CSR1_RTCSEL_SHIFT       (8)       /* Bits 8-9: RTC clock source selection */
#define RCC_CSR1_RTCSEL_MASK        (3 << RCC_CSR1_RTCSEL_SHIFT)
#  define RCC_CSR1_RTCSEL_NOCLK     (0 << RCC_CSR1_RTCSEL_SHIFT)
#  define RCC_CSR1_RTCSEL_LSE       (1 << RCC_CSR1_RTCSEL_SHIFT)
#  define RCC_CSR1_RTCSEL_LSI       (2 << RCC_CSR1_RTCSEL_SHIFT)
#  define RCC_CSR1_RTCSEL_HSEd32    (3 << RCC_CSR1_RTCSEL_SHIFT)
                                              /* Bits 10-14: Reserved */
#define RCC_CSR1_RTCEN              (1 << 15) /* Bit 15: RTC clock enable */
#define RCC_CSR1_RTCRST             (1 << 16) /* Bit 16: RTC software reset */
                                              /* Bits 17-23: Reserved */
#define RCC_CSR1_LSCOEN             (1 << 24) /* Bit 24: Low-speed clock output (LSCO) enable */
#define RCC_CSR1_LSCOSEL            (1 << 25) /* Bit 25: Low-speed clock output selection */
                                              /* Bits 26-31: Reserved */

/* Clock configuration register 2 */

#define RCC_CSR2_LSION              (1 << 0)  /* Bit 0: LSI oscillator enable */
#define RCC_CSR2_LSIRDY             (1 << 1)  /* Bit 1: LSI oscillator ready */
                                              /* Bits 2-22: Reserved */
#define RCC_CSR2_RMVF               (1 << 23) /* Bit 23: Remove reset flag */
                                              /* Bit 24: Reserved */
#define RCC_CSR2_OBLRSTF            (1 << 25) /* Bit 25: Options bytes loading reset flag */
#define RCC_CSR2_PINRSTF            (1 << 26) /* Bit 26: PIN reset flag */
#define RCC_CSR2_PORRSTF            (1 << 27) /* Bit 27: POR/PDR reset flag */
#define RCC_CSR2_SFTRSTF            (1 << 28) /* Bit 28: software reset flag */
#define RCC_CSR2_IWDGRSTF           (1 << 29) /* Bit 29: IWDG reset flag */
#define RCC_CSR2_WWDGRSTF           (1 << 30) /* Bit 30: WWDG reset flag */
#define RCC_CSR2_LPWRRSTF           (1 << 31) /* Bit 31: Low-power reset flag */

#endif /* __ARCH_ARM_SRC_STM32C0_HARDWARE_STM32C0_RCC_H */
